app/Controllers/Bidder.php

public function index()
    {
        // Fetch products from the database using ProductModel
        $productModel = new ProductModel(); // Adjust this based on your actual model
        $products = $productModel->findAll(); // Adjust this based on your actual product retrieval logic

        // Fetch user details based on bidder_id from session
        $bidder_id = session()->get('bidder_id') ?? 1; // Default to 1 if not set
        $bidderModel = new BidderModel(); // Adjust this based on your actual model
        $user = $bidderModel->find($bidder_id);
---
SELECT *
FROM `products`
SELECT *
FROM `bidders`
WHERE `bidders`.`bidder_id` = 1

    public function yourBids()
{
    // Fetch current bidder ID from session
    $bidder_id = session()->get('bidder_id') ?? 1; // Default to 1 if not set
    $user = $this->userModel->find($bidder_id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1