app/Controllers/Seller.php

SELECT `products`.*, `bids`.`amount` as `bid_amount`, `users`.`name` as `seller_name`
FROM `products`
JOIN `bids` ON `bids`.`product_id` = `products`.`id`
JOIN `sellers` ON `products`.`seller_id` = `sellers`.`seller_id`
JOIN `users` ON `sellers`.`user_id` = `users`.`id`
WHERE `bids`.`status` = 'approved'
AND  `products`.`name` LIKE '%l%' ESCAPE '!'
OR  `products`.`description` LIKE '%l%' ESCAPE '!'
OR  `users`.`name` LIKE '%l%' ESCAPE '!'
---
public function productBids()
{
    $db = \Config\Database::connect();
    $builder = $db->table('products')
        ->select('products.*, bids.amount as bid_amount, users.name as seller_name')
        ->join('bids', 'bids.product_id = products.id')
        ->join('sellers', 'products.seller_id = sellers.seller_id')
        ->join('users', 'sellers.user_id = users.id')
        ->where('bids.status', 'approved');

    // Check if there's a search query
    $searchTerm = $this->request->getGet('search');
    if ($searchTerm) {
        $builder->like('products.name', $searchTerm)
                ->orLike('products.description', $searchTerm)
                ->orLike('users.name', $searchTerm);
    }

    $products = $builder->get()->getResult();